{
    "problems": [
        {
            "statement": "Given a list of strings sentence where each sentence[i] is a string with single character, reverse the order of the words in the sentence. You may assume there's no extraneous spaces in the sentence. Can you do modify sentence in-place and solve in O(1) space?",
            "link": "https://binarysearch.com/problems/Sentence-Reversal",
            "categories": [
                "array",
                "two_pointers"
            ]
        },
        {
            "statement": "You are given an integer n, and there's n switches in a room all in off position and n people who flip switches as follows: Person 1 comes and flips all switches that are multiples of 1, so all of them. Person 2 flips switches that are multiples of 2: 2, 4, 6, ... Person i flips switches that are multiples of i. Return number of switches that will be in on position at the end.",
            "link": "https://binarysearch.com/problems/Light-Bulb-Toggling",
            "categories": [
                "math"
            ]
        },
        {
            "statement": "You are given a list of positive integers nums. Consider an operation where you pick a number, remove it and increase your score by the sum of the number and its two adjacent numbers. You can perform this operation as many times you want as long as you don't pick the first or the last number in the list. Return the maximal score possible.",
            "link": "https://binarysearch.com/problems/Maximum-Additive-Score-by-Removing-Numbers",
            "categories": [
                "dynamic_programming"
            ]
        },
        {
            "statement": "Given a list of integers nums, remove numbers that appear multiple times in the list, while maintaining order of the appearance in the original list. It should use O(k) space where k is the number of unique integers.",
            "link": "https://binarysearch.com/problems/Remove-Duplicate-Numbers",
            "categories": [
                "two_pointers",
                "array",
                "hash_table"
            ]
        },
        {
            "statement": "You are given four lists of integers A, B, C, D and an integer target. Return the number of different unique indices i, j, k, l such that A[i] + B[j] + C[k] + D[l] ≤ target.",
            "link": "https://binarysearch.com/problems/Sum-of-Four-Numbers-Less-Than-Target",
            "categories": [
                "binary_search"
            ]
        },
        {
            "statement": "You are given a list of integers cards, and are looking to order the cards in a way so that they are revealed in ascending order. The cards are revealed in this manner: the top card is removed and revealed and then next card is moved to the back. This is repeated until there's no more cards. Return an ordering of the cards such that they are revealed in ascending order.",
            "link": "https://binarysearch.com/problems/Ascending-Cards",
            "categories": [
                "array"
            ]
        },
        {
            "statement": "Given an integer list nums where each number represents the maximum number of hops you can make, determine whether you can reach to the last index starting at index 0.",
            "link": "https://binarysearch.com/problems/Hoppable",
            "categories": [
                "array",
                "dynamic_programming"
            ]
        },
        {
            "statement": "You are given a binary tree root containing unique integers and integers target and radius. Return a sorted list of values of all nodes that are distance radius away from the node with value target.",
            "link": "https://binarysearch.com/problems/Binary-Tree-Nodes-Around-Radius",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "Given a two-dimensional integer matrix of 1s and 0s where 0 represents empty cell and 1 represents a block that forms a shape, return the perimeter of the shape. There is guaranteed to be exactly one shape, and the shape has no holes in it.",
            "link": "https://binarysearch.com/problems/Island-Shape-Perimeter",
            "categories": [
                "graph"
            ]
        },
        {
            "statement": "You are given a two dimensional array matrix, containing strings 'r', 'g', and 'b'. Perform a floodfill operation at row r, column c with the color target. A floodfill operation replaces elements that are connected to matrix[r][c] (up/right/down/left) and have the same color as matrix[r][c] with the color of target.",
            "link": "https://binarysearch.com/problems/Paint-Bucket",
            "categories": [
                "graph"
            ]
        },
        {
            "statement": "Given a list of [x, y] coordinates in a Cartesian plane, return whether the coordinates form a straight line segment.",
            "link": "https://binarysearch.com/problems/Line-Segment",
            "categories": [
                "math"
            ]
        },
        {
            "statement": "You are given a two-dimensional list of integers requests and an integer k. Each element requests[i] contains [start, end] representing an inclusive interval for the possible times when user i visited the website. Each user visits the site exactly once. Return the users who may have been the kth (0-indexed) user to visit the site, sorted in ascending order. You can assume that the site can serve an unlimited number of users at any time.",
            "link": "https://binarysearch.com/problems/Kth-User-to-Visit-Website",
            "categories": [
                "greedy",
                "binary_search",
                "line_sweep"
            ]
        },
        {
            "statement": "Given the mapping 'a' = 1, 'b' = 2, ... 'z' = 26, and an encoded message message (as a string), count the number of ways it can be decoded.",
            "link": "https://binarysearch.com/problems/Decode-Message",
            "categories": [
                "dynamic_programming"
            ]
        },
        {
            "statement": "You are given two lists of integers customers and mood, both of them the same length, and an integer k. On each minute i, customers[i] number of people come to the store and if mood[i] = 1, then the customers are happy whereas if mood[i] = 0, then they are unhappy. Given that you can set a sublist of length k of mood to 1s, return the maximum number of people you can make happy.",
            "link": "https://binarysearch.com/problems/Angry-Owner",
            "categories": [
                "array",
                "two_pointers"
            ]
        },
        {
            "statement": "Given a lowercase alphabet string s, return the number of palindromic substrings in s.",
            "link": "https://binarysearch.com/problems/Number-of-Palindromic-Substrings",
            "categories": [
                "string",
                "dynamic_programming"
            ]
        },
        {
            "statement": "Given a binary tree root, consider deleting an edge in the tree so that the tree becomes disjoint with two trees. Then, take the sum of each subtree and multiply the two numbers. Return the largest such product we can get after deleting one edge.",
            "link": "https://binarysearch.com/problems/Split-Tree-to-Maximize-Product",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "You are given a list of integers nums. We can partition the list into some sublists and sort each piece. Return the maximum number of sublists we can partition to such that nums as a whole is sorted afterwards.",
            "link": "https://binarysearch.com/problems/Partition-Lists-to-Make-Sorted-List",
            "categories": [
                "prefix_sum",
                "array"
            ]
        },
        {
            "statement": "Given a list of integers nums, consider an operation where you update an element to any value. Given that you can perform at most 3 of these operations, return the resulting minimum difference between the max and the min value in nums.",
            "link": "https://binarysearch.com/problems/Minimum-Difference-of-Extremes",
            "categories": [
                "array"
            ]
        },
        {
            "statement": "Consider a modified binary search, where instead of picking the middle element as the pivot, we pick it randomly between the low and the high indices. Given a list of integers nums that's not necessarily sorted, return the number of elements that will always be found using this modified binary search.",
            "link": "https://binarysearch.com/problems/Randomized-Binary-Search",
            "categories": [
                "array",
                "prefix_sum"
            ]
        },
        {
            "statement": "You are given a two dimensional matrix where a 1 represents a live cell and a 0 represents a dead cell. A cell's (living or dead) neighbors are its immediate horizontal, vertical and diagonal cells. Compute the next state of the matrix using these rules: 1. Any living cell with two or three living neighbors lives. 2. Any dead cell with three living neighbors becomes a live cell. 3. All other cells die.",
            "link": "https://binarysearch.com/problems/Conway's-Game-of-Life",
            "categories": [
                "array"
            ]
        },
        {
            "statement": "Given a string s containing round, curly, and square open and closing brackets, return whether the brackets are balanced.",
            "link": "https://binarysearch.com/problems/Balanced-Brackets-Sequel",
            "categories": [
                "stack",
                "string"
            ]
        },
        {
            "statement": "Given two lowercase alphabet strings a and b, consider an operation where we delete any character in either string. Return the minimum number of operations required such that both strings are equal.",
            "link": "https://binarysearch.com/problems/Delete-Characters-to-Equalize-Strings",
            "categories": [
                "string",
                "dynamic_programming"
            ]
        },
        {
            "statement": "Given a list of integers nums, return the number of contiguous arithmetic sequences of length ≥ 3.",
            "link": "https://binarysearch.com/problems/Arithmetic-Sequences",
            "categories": [
                "array"
            ]
        },
        {
            "statement": "Given a binary tree root containing unique values and an integer k, return the number of k-length unique paths in the tree. Paths can go either parent to child or child to parent. Two paths are different if some node appears in one path but not the other.",
            "link": "https://binarysearch.com/problems/Counting-K-Length-Paths-on-Binary-Tree",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "Given an integer n, return the number of strings of length n that can be formed under the following rules: Each character is a lower case vowel 'a', 'e', 'i', 'o', 'u'. 'a' may only be followed by an 'e'. 'e' may only be followed by an 'a' or an 'i'. 'i' may not be followed by another 'i'. 'o' may only  be followed by an 'i' or a 'u'. 'u' may only be followed by an 'a'. Return the result mod 10 ** 9 + 7.",
            "link": "https://binarysearch.com/problems/Grammar-Rules",
            "categories": [
                "math",
                "dynamic_programming"
            ]
        },
        {
            "statement": "Given positive integers start and end, return the minimum number of operations needed to convert start to end using these operations: Decrement by 1 or Multiply by 2. ",
            "link": "https://binarysearch.com/problems/Target-Number-with-Operations-Sequel",
            "categories": [
                "math"
            ]
        },
        {
            "statement": "Given a list of string words and a string s, return the number of strings in words that are subsequences of s.",
            "link": "https://binarysearch.com/problems/Subsequence-Match-Target",
            "categories": [
                "string"
            ]
        },
        {
            "statement": "You are given a list of integers nums where each integer occurs exactly three times except for one which occurs once. Return the lone integer. Bonus: solve it in O(1) space.",
            "link": "https://binarysearch.com/problems/Lone-Integer",
            "categories": [
                "bit_manipulation"
            ]
        },
        {
            "statement": "You are given a list of integers nums and an integer k. Consider an operation where you increment some element by one. Given that you can perform this at most k times, return the value of the most frequently occurring number you can obtain. If there's more than one solution, pick the smallest possible number.",
            "link": "https://binarysearch.com/problems/Most-Occurring-Number-After-K-Increments",
            "categories": [
                "two_pointers",
                "array"
            ]
        },
        {
            "statement": "Given a list of integers nums, write a function that returns the largest sum of non-adjacent numbers. Numbers can be 0 or negative.",
            "link": "https://binarysearch.com/problems/Largest-Sum-of-Non-Adjacent-Numbers",
            "categories": [
                "dynamic_programming"
            ]
        },
        {
            "statement": "Given a binary search tree root, and integers lo and hi, return the count of all nodes in root whose values are between [lo, hi] (inclusive).",
            "link": "https://binarysearch.com/problems/Count-BST-Nodes-in-a-Range",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "You are given a lowercase alphabet string s and a list of integers shifts. Each element shifts[i] means to shift the first i + 1 letters of s by shifts[i] positions. Shifting a letter should wrap over 'z' to 'a'. For example, shifting 'z' by 2 results in 'b'. Return the resulting string after applying shifts to s.",
            "link": "https://binarysearch.com/problems/Bulk-Shift-Letters",
            "categories": [
                "string"
            ]
        },
        {
            "statement": "Given a binary tree root, find the value of the deepest node. If there's more than one deepest node, then return the leftmost one.",
            "link": "https://binarysearch.com/problems/Leftmost-Deepest-Tree-Node",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "Implement a data structure with the following methods: 1. WordDistanceQuerier(String[] words) which constructs the instance. 2. distance(String a, String b) which returns the shortest distance between word a and b in words. You can assume that a and b exists in words and a ≠ b.",
            "link": "https://binarysearch.com/problems/Word-Distance-Queries",
            "categories": [
                "data_structure"
            ]
        },
        {
            "statement": "You are given a two-dimensional list of integers matrix where each matrix[r][c] represents the number of coins in that cell. When you pick up coins on matrix[r][c], all the coins on row r - 1 and r + 1 disappear, as well as the coins at the two cells matrix[r][c + 1] and matrix[r][c - 1]. Return the maximum number of coins that you can collect.",
            "link": "https://binarysearch.com/problems/Collecting-Disappearing-Coins",
            "categories": [
                "dynamic_programming"
            ]
        },
        {
            "statement": "Given a binary tree root, return the maximum average value of a subtree. A subtree is defined to be some node in root including all of its descendants. A subtree average is the sum of the node values divided by the number of nodes.",
            "link": "https://binarysearch.com/problems/Subtree-with-Maximum-Average",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "You are given a lowercase alphabet string s and an integer k. Consider an operation where we perform a run-length encoding on a string by representing repeated successive characters as a count and character. For example, the string 'aabbbc' would be encoded as '2a3bc'. Note that we don't put '1c' for 'c' since it only appears once successively. Given that you can first remove any k consecutive characters in s, return the minimum length possible of the resulting run-length encoding.",
            "link": "https://binarysearch.com/problems/Lossy-Run-Length-Encoding",
            "categories": [
                "string"
            ]
        },
        {
            "statement": "You are given a string s containing valid number of brackets '(', ')' and lowercase alphabet characters. Return the string after removing all outermost brackets that enclose the whole string.",
            "link": "https://binarysearch.com/problems/Removing-Enclosed-Parentheses",
            "categories": [
                "string"
            ]
        },
        {
            "statement": "You are given a two-dimensional list of integers coordinates where each element contains (x, y) representing a coordinate in a Cartesian plane. Remove every point (a, b) if there's another point (c, d) such that a ≤ c and b ≤ d. The relative ordering of the original list should be maintained.",
            "link": "https://binarysearch.com/problems/Remove-Smaller-Coordinates",
            "categories": [
                "array"
            ]
        },
        {
            "statement": "You are given a list of integers nums representing a circular list (the first and the last elements are adjacent). Return the largest sum of non-adjacent numbers.",
            "link": "https://binarysearch.com/problems/Largest-Sum-of-Non-Adjacent-Numbers-in-Circular-List",
            "categories": [
                "dynamic_programming",
                "array"
            ]
        },
        {
            "statement": "You are given a two-dimensional list of integers points and an integer k. Each list in points is of the form (x, y) representing Cartesian coordinates. Assuming you can group any point a and b if the Euclidean distance between them is ≤ k, return the total number of disjoint groups. Note that if points a and b are grouped and b and c are grouped, then a and c are in the same group.",
            "link": "https://binarysearch.com/problems/Group-Points",
            "categories": [
                "union_find",
                "graph"
            ]
        },
        {
            "statement": "Given a string s, return the number of ways to partition the string such that each part is a palindrome.",
            "link": "https://binarysearch.com/problems/Palindrome-Splitting",
            "categories": [
                "string"
            ]
        },
        {
            "statement": "There's a staircase with n steps, and you can climb up either 1 or 2 steps at a time. Given an integer n, write a function that returns the number of unique ways you can climb the staircase. The order of the steps matters, so each different order of steps counts as a way. Mod the result by 10 ** 9 + 7.",
            "link": "https://binarysearch.com/problems/A-Flight-of-Stairs",
            "categories": [
                "dynamic_programming"
            ]
        },
        {
            "statement": "You are given a list of positive integers nums. Consider an operation where we remove any two integers a and b with a ≤ b and if a < b, insert back b - a into nums. Given that you can make any number of operations, return the smallest remaining number you can get. If the list becomes empty, return 0.",
            "link": "https://binarysearch.com/problems/Crush-Numbers",
            "categories": [
                "dynamic_programming"
            ]
        },
        {
            "statement": "Given a list of integers denominations and an integer amount, find the minimum number of coins needed to make amount. Return -1 if there's no way to make amount.",
            "link": "https://binarysearch.com/problems/Making-Change-Sequel",
            "categories": [
                "dynamic_programming"
            ]
        },
        {
            "statement": "Given a binary tree root, return whether it's a binary search tree. A binary tree node is a binary search tree if: 1. All nodes on its left subtree are smaller than node.val 2. All nodes on its right subtree are bigger than node.val. 3. All nodes hold the these properties.",
            "link": "https://binarysearch.com/problems/Binary-Search-Tree-Validation",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "You are given a two-dimensional integer matrix matrix containing 1s and 0s. 1 represents land and 0 represents water. An island is a group of 1s that are neighboring whose perimeter is surrounded by water. Return the number of completely surrounded islands.",
            "link": "https://binarysearch.com/problems/Surrounded-Islands",
            "categories": [
                "array"
            ]
        },
        {
            "statement": "Given a list of integers nums and an integer k, return the length of the longest sublist where the absolute difference between the largest and smallest element of the sublist is ≤ k.",
            "link": "https://binarysearch.com/problems/Longest-Sublist-with-Absolute-Difference-Condition",
            "categories": [
                "monoqueue"
            ]
        },
        {
            "statement": "You are given a list of integers nums where each value represents a group of people looking to skydive together. You are also given k representing the number of days the skydiving facility is open for. Return the minimum capacity of the plane you need to be able to fulfill all requests in k days. Note that requests should be fulfilled in the order they were given and a plane can only have one flight per day.",
            "link": "https://binarysearch.com/problems/Skydivers",
            "categories": [
                "binary_search"
            ]
        },
        {
            "statement": "Given a binary tree root, return the sum of the longest path from the root to a leaf node. If there are two equally long paths, return the larger sum.",
            "link": "https://binarysearch.com/problems/Longest-Tree-Sum-Path-From-Root-to-Leaf",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "You are given two integers, a and b. In each operation, you can choose either integer, and either increment it by 1 or decrement it by 1. What is the minimum number of operations you need such that the greatest common divisor between a and b is ≠ 1? Note that you are allowed to make 0 operations if no operations are needed.",
            "link": "https://binarysearch.com/problems/Coprime-Suspects",
            "categories": [
                "math"
            ]
        },
        {
            "statement": "You are given a binary tree root and an integer target. Return the number of pairs of leaves such that the shortest distance between them is less than or equal to target.",
            "link": "https://binarysearch.com/problems/Leaf-Pairs-Less-Than-Target-Distance-Away",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "Given a list of integers nums, select a subsequence of strictly increasing numbers, where the differences of each two numbers is the same as the differences of their two indexes. Return the maximum sum of such a subsequence.",
            "link": "https://binarysearch.com/problems/Subsequence-Sum",
            "categories": [
                "array"
            ]
        },
        {
            "statement": "You are given a list of integers piles and an integer k. piles[i] represents the number of bananas on pile i. On each hour, you can choose any pile and eat r number of bananas in that pile. If you pick a pile with fewer than r bananas, it still takes an hour to eat the pile. Return the minimum r required such that you can eat all the bananas in less than or equal to k hours.",
            "link": "https://binarysearch.com/problems/Eat-Bananas-in-K-Hours",
            "categories": [
                "binary_search",
                "array"
            ]
        },
        {
            "statement": "Given a list of integers nums and an integer k, return whether the list can be partitioned into pairs such that each pair's sum is divisible by k.",
            "link": "https://binarysearch.com/problems/Partition-List-to-Pairs-that-Are-Divisible-by-K",
            "categories": [
                "two_pointers"
            ]
        },
        {
            "statement": "You are given a list of non-negative integers nums. Return the maximum sum of a sublist in nums containing only unique values.",
            "link": "https://binarysearch.com/problems/Maximum-Unique-Sublist-Sum",
            "categories": [
                "array",
                "two_pointers"
            ]
        },
        {
            "statement": "You are given a two-dimensional list of integers matrix containing 1s and 0s. In one operation, you can swap two adjacent rows. Return the minimum number of operations needed to make all cells above the top-left to bottom-right diagonal all 0s. If there's no solution, return -1.",
            "link": "https://binarysearch.com/problems/Place-Zeros-Above-the-Matrix-Diagonal",
            "categories": [
                "greedy"
            ]
        },
        {
            "statement": "You are given a two-dimensional list of integers edges, a list of floats success, and integers start and end. edges represents an undirected, weighted graph. Each edges[i] contains [u, v] meaning u and v is connected, and the chance of successfully traversing the edge is success[i] chance. Given that you start at node start and you want to arrive at node end, return the highest overall chance you can get by taking any path. If there's no path to end, return 0.",
            "link": "https://binarysearch.com/problems/Path-to-Maximize-Probability-to-Destination",
            "categories": [
                "graph"
            ]
        },
        {
            "statement": "You are given two binary search trees a and b and an integer target. Return whether there's a number in a and a number in b such that their sum equals to target",
            "link": "https://binarysearch.com/problems/Sum-of-Two-Numbers-in-BSTs",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "You are given a list of strings mailboxes. Each mailbox is a list of strings, where each string is either 'junk', 'personal', 'work'. Go through each mailbox in round robin order starting from the first one, filtering out junk, to form a single pile and return the pile.",
            "link": "https://binarysearch.com/problems/Sorting-Mail",
            "categories": [
                "bfs"
            ]
        },
        {
            "statement": "You are given a two-dimensional list of non-negative integers matrix and a non-negative integer target. Return the area of the largest square sub-matrix whose sum is less than or equal to target. If there's no such matrix, return 0.",
            "link": "https://binarysearch.com/problems/Square-Submatrix-Sum-Below-Target",
            "categories": [
                "array",
                "binary_search"
            ]
        },
        {
            "statement": "Given a lowercase alphabet string s, return the minimum number of characters that we need to delete such that the frequency of each character occurs a unique number of times.",
            "link": "https://binarysearch.com/problems/Unique-String-Frequencies",
            "categories": [
                "string",
                "greedy"
            ]
        },
        {
            "statement": "You are given two lists of integers cores and tasks. Each cores[i] represents the number of cores available in server i. And each tasks[i] represents the number of cores needed to run that task. Each task can be run in only one server but each server can run multiple tasks. Return whether it's possible to run all the tasks with the given cores.",
            "link": "https://binarysearch.com/problems/Cluster-Management",
            "categories": [
                "backtracking"
            ]
        },
        {
            "statement": "Given a binary tree root, return the largest absolute difference between any node and its descendants.",
            "link": "https://binarysearch.com/problems/Largest-Difference-Between-Node-and-a-Descendant",
            "categories": [
                "tree"
            ]
        },
        {
            "statement": "You are given a two-dimensional integer matrix, where matrix[r][c] represents the height of a condominium in a city. The west-east skyline can be seen by taking the maximum of each row in the matrix. Similarly, the north-south skyline can be seen by taking the maximum of each column. Return a new matrix where each condominium's height is increased to the maximum possible height while keeping the same west-east and north-south skyline.",
            "link": "https://binarysearch.com/problems/Condo-Developers",
            "categories": [
                "hash_table"
            ]
        }
    ]
}